Taxud_configuration/c1-jmeter/1-min-warmup-then-100-ms-5k-2-hour.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Host of Webservice</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">text/xml; charset=utf-8</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Warmup 15 seconds" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <longProp name="ThreadGroup.start_time">1516268560000</longProp>
        <longProp name="ThreadGroup.end_time">1516268560000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">15</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Soap Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;soap:Envelope xmlns:soap=&quot;http://www.w3.org/2003/05/soap-envelope&quot; xmlns:ns=&quot;http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/&quot; xmlns:_1=&quot;http://org.ecodex.backend/1_1/&quot; xmlns:xm=&quot;http://www.w3.org/2005/05/xmlmime&quot;&gt;&#xd;
   &lt;soap:Header&gt;&#xd;
      &lt;ns:Messaging&gt;&#xd;
         &lt;ns:UserMessage&gt;&#xd;
            &lt;ns:PartyInfo&gt;&#xd;
               &lt;ns:From&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:EORI&quot;&gt;BE00000001&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Trader&lt;/ns:Role&gt;&#xd;
               &lt;/ns:From&gt;&#xd;
               &lt;ns:To&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:authority&quot;&gt;sti-taxud&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Customs&lt;/ns:Role&gt;&#xd;
               &lt;/ns:To&gt;&#xd;
            &lt;/ns:PartyInfo&gt;&#xd;
            &lt;ns:CollaborationInfo&gt;&#xd;
               &lt;ns:Service&gt;eu_ics2_t2c&lt;/ns:Service&gt;&#xd;
               &lt;ns:Action&gt;IE3F10&lt;/ns:Action&gt;&#xd;
               &lt;ns:AgreementRef&gt;EU-ICS2-TI-V1.0&lt;/ns:AgreementRef&gt;&#xd;
            &lt;/ns:CollaborationInfo&gt;&#xd;
            &lt;ns:MessageProperties&gt;&#xd;
               &lt;ns:Property name=&quot;originalSender&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C1&lt;/ns:Property&gt;&#xd;
               &lt;ns:Property name=&quot;finalRecipient&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C4&lt;/ns:Property&gt;&#xd;
            &lt;/ns:MessageProperties&gt;&#xd;
            &lt;ns:PayloadInfo&gt;&#xd;
               &lt;ns:PartInfo href=&quot;cid:message&quot;&gt;&#xd;
                  &lt;ns:PartProperties&gt;&#xd;
                     &lt;ns:Property name=&quot;MimeType&quot;&gt;text/xml&lt;/ns:Property&gt;&#xd;
                  &lt;/ns:PartProperties&gt;&#xd;
               &lt;/ns:PartInfo&gt;&#xd;
            &lt;/ns:PayloadInfo&gt;&#xd;
         &lt;/ns:UserMessage&gt;&#xd;
      &lt;/ns:Messaging&gt;&#xd;
   &lt;/soap:Header&gt;&#xd;
   &lt;soap:Body&gt;&#xd;
       &lt;_1:submitRequest&gt;         &#xd;
         &lt;payload payloadId=&quot;cid:message&quot;&gt;&#xd;
&lt;value&gt;PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+Cg==&lt;/value&gt;&#xd;
         
&lt;/payload&gt;&#xd;
      &lt;/_1:submitRequest&gt;&#xd;
   &lt;/soap:Body&gt;&#xd;
&lt;/soap:Envelope&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/domibus/services/backend</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">4</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>60.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Warmup 15seconds" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <longProp name="ThreadGroup.start_time">1516268560000</longProp>
        <longProp name="ThreadGroup.end_time">1516268560000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">15</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Soap Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;soap:Envelope xmlns:soap=&quot;http://www.w3.org/2003/05/soap-envelope&quot; xmlns:ns=&quot;http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/&quot; xmlns:_1=&quot;http://org.ecodex.backend/1_1/&quot; xmlns:xm=&quot;http://www.w3.org/2005/05/xmlmime&quot;&gt;&#xd;
   &lt;soap:Header&gt;&#xd;
      &lt;ns:Messaging&gt;&#xd;
         &lt;ns:UserMessage&gt;&#xd;
            &lt;ns:PartyInfo&gt;&#xd;
               &lt;ns:From&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:EORI&quot;&gt;BE00000001&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Trader&lt;/ns:Role&gt;&#xd;
               &lt;/ns:From&gt;&#xd;
               &lt;ns:To&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:authority&quot;&gt;sti-taxud&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Customs&lt;/ns:Role&gt;&#xd;
               &lt;/ns:To&gt;&#xd;
            &lt;/ns:PartyInfo&gt;&#xd;
            &lt;ns:CollaborationInfo&gt;&#xd;
               &lt;ns:Service&gt;eu_ics2_t2c&lt;/ns:Service&gt;&#xd;
               &lt;ns:Action&gt;IE3F10&lt;/ns:Action&gt;&#xd;
               &lt;ns:AgreementRef&gt;EU-ICS2-TI-V1.0&lt;/ns:AgreementRef&gt;&#xd;
            &lt;/ns:CollaborationInfo&gt;&#xd;
            &lt;ns:MessageProperties&gt;&#xd;
               &lt;ns:Property name=&quot;originalSender&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C1&lt;/ns:Property&gt;&#xd;
               &lt;ns:Property name=&quot;finalRecipient&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C4&lt;/ns:Property&gt;&#xd;
            &lt;/ns:MessageProperties&gt;&#xd;
            &lt;ns:PayloadInfo&gt;&#xd;
               &lt;ns:PartInfo href=&quot;cid:message&quot;&gt;&#xd;
                  &lt;ns:PartProperties&gt;&#xd;
                     &lt;ns:Property name=&quot;MimeType&quot;&gt;text/xml&lt;/ns:Property&gt;&#xd;
                  &lt;/ns:PartProperties&gt;&#xd;
               &lt;/ns:PartInfo&gt;&#xd;
            &lt;/ns:PayloadInfo&gt;&#xd;
         &lt;/ns:UserMessage&gt;&#xd;
      &lt;/ns:Messaging&gt;&#xd;
   &lt;/soap:Header&gt;&#xd;
   &lt;soap:Body&gt;&#xd;
       &lt;_1:submitRequest&gt;         &#xd;
         &lt;payload payloadId=&quot;cid:message&quot;&gt;&#xd;
&lt;value&gt;PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+Cg==&lt;/value&gt;&#xd;
         
&lt;/payload&gt;&#xd;
      &lt;/_1:submitRequest&gt;&#xd;
   &lt;/soap:Body&gt;&#xd;
&lt;/soap:Envelope&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/domibus/services/backend</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">4</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>180.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="20 mins at 50tps" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1516268560000</longProp>
        <longProp name="ThreadGroup.end_time">1516268560000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">7200</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Soap Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;soap:Envelope xmlns:soap=&quot;http://www.w3.org/2003/05/soap-envelope&quot; xmlns:ns=&quot;http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/&quot; xmlns:_1=&quot;http://org.ecodex.backend/1_1/&quot; xmlns:xm=&quot;http://www.w3.org/2005/05/xmlmime&quot;&gt;&#xd;
   &lt;soap:Header&gt;&#xd;
      &lt;ns:Messaging&gt;&#xd;
         &lt;ns:UserMessage&gt;&#xd;
            &lt;ns:PartyInfo&gt;&#xd;
               &lt;ns:From&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:EORI&quot;&gt;BE00000001&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Trader&lt;/ns:Role&gt;&#xd;
               &lt;/ns:From&gt;&#xd;
               &lt;ns:To&gt;&#xd;
                  &lt;ns:PartyId type=&quot;urn:oasis:names:tc:ebcore:partyid-type:unregistered:eu-customs:authority&quot;&gt;sti-taxud&lt;/ns:PartyId&gt;&#xd;
                  &lt;ns:Role&gt;Customs&lt;/ns:Role&gt;&#xd;
               &lt;/ns:To&gt;&#xd;
            &lt;/ns:PartyInfo&gt;&#xd;
            &lt;ns:CollaborationInfo&gt;&#xd;
               &lt;ns:Service&gt;eu_ics2_t2c&lt;/ns:Service&gt;&#xd;
               &lt;ns:Action&gt;IE3F10&lt;/ns:Action&gt;&#xd;
               &lt;ns:AgreementRef&gt;EU-ICS2-TI-V1.0&lt;/ns:AgreementRef&gt;&#xd;
            &lt;/ns:CollaborationInfo&gt;&#xd;
            &lt;ns:MessageProperties&gt;&#xd;
               &lt;ns:Property name=&quot;originalSender&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C1&lt;/ns:Property&gt;&#xd;
               &lt;ns:Property name=&quot;finalRecipient&quot;&gt;urn:oasis:names:tc:ebcore:partyid-type:unregistered:C4&lt;/ns:Property&gt;&#xd;
            &lt;/ns:MessageProperties&gt;&#xd;
            &lt;ns:PayloadInfo&gt;&#xd;
               &lt;ns:PartInfo href=&quot;cid:message&quot;&gt;&#xd;
                  &lt;ns:PartProperties&gt;&#xd;
                     &lt;ns:Property name=&quot;MimeType&quot;&gt;text/xml&lt;/ns:Property&gt;&#xd;
                  &lt;/ns:PartProperties&gt;&#xd;
               &lt;/ns:PartInfo&gt;&#xd;
            &lt;/ns:PayloadInfo&gt;&#xd;
         &lt;/ns:UserMessage&gt;&#xd;
      &lt;/ns:Messaging&gt;&#xd;
   &lt;/soap:Header&gt;&#xd;
   &lt;soap:Body&gt;&#xd;
       &lt;_1:submitRequest&gt;         &#xd;
         &lt;payload payloadId=&quot;cid:message&quot;&gt;&#xd;
&lt;value&gt;PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+PGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT4KPGE+dGhpcyBpcyBhIHRlc3QgZm9yIDUgazwvYT48YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPgo8YT50aGlzIGlzIGEgdGVzdCBmb3IgNSBrPC9hPjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+CjxhPnRoaXMgaXMgYSB0ZXN0IGZvciA1IGs8L2E+Cg==&lt;/value&gt;&#xd;
         
&lt;/payload&gt;&#xd;
      &lt;/_1:submitRequest&gt;&#xd;
   &lt;/soap:Body&gt;&#xd;
&lt;/soap:Envelope&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/domibus/services/backend</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">4</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>6000</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>